#ifndef	_USER_MATH_C_
#define _USER_MATH_C_
//------------------------------------------------------------------------------
// *****************************************************************************
// *                                                                           *
// *    版权说明：Copyright(C) 2007-2012 青岛斑科变频技术有限公司              *
// *    文件名：                                                               * 
// *    作者:     林爱军                                                       *
// *    文件版本: 1.00                                                         *
// *    生成日期: 2009年4月14日                                                *
// *    描述：                                                                 *
// *    版本信息:                                                              *
// *        必需的其他文件:  p30f3010.gld, libpic30.a                          *
// *        使用的工具:      MPLAB IDE -> 8.00                                 *
// *                         Compiler  -> 3.02                                 *
// *                         Assembler -> 2.00                                 *
// *                         Linker    -> 2.00                                 *
// *        支持的芯片:      dsPIC30F3010                                      *
// *    函数列表:                                                              *
// *            1.                                                             * 
// *    历史修改记录:                                                          *
// *            1. 作者：                                                      *
// *               日期：                                                      *
// *               版本：                                                      *
// *               描述：                                                      *
// *                                                                           *
// *                                                                           *
// *                                                                           *
// *                                                                           *
// *****************************************************************************
//------------------------------------------------------------------------------
#include "user_typedefine.h"

//------------------------------------------------------------------------------
int32_t lowpass_filter(int16_t last_val, int16_t last_mod, int16_t now_val, int16_t index);
//------------------------------------------------------------------------------
// *****************************************************************************
// *                                                                           *
// *  函数名称:                                                                *
// *           signed int linearfunc(signed int offset_x,                      *
// *                                 signed int offset_y,                      *
// *                                 signed int gain_k,                      *
// *                                 unsigned int mul_k,                       *
// *                                 signed int real_x,)                       *
// *  功能描述:  线性函数，根据x值，得到y值的程序                              *
// *  扇入函数:  //被本函数调用的函数清单                                      *
// *  扇出函数:  //调用本函数的函数清单                                        *
// *                                                                           *
// *                                                                           *
// *  输入参数:      offset_x   //代表截矩的x坐标值                                 *
// *             offset_y   //代表截矩的y坐标值                                 *
// *             gain_k     //代表斜率的大小，一般放大2的mul_k次幂倍            *
// *             mul_k      //代表斜率的放大倍率，以2的次幂为单位               *
// *             real_x     //代表当前实际的x坐标值                             *
// *  输出参数:                                                                *
// *  全局变量：                                                               *
// *  函数返回值: lsi_real_y      //代表计算得到的实际坐标值                   *
// *  其他说明:   无                                                           *
// *                                                                           *
// *****************************************************************************
//------------------------------------------------------------------------------
/*
signed int linearfunc(signed int offset_x,signed int offset_y,
                      signed int gain_k,unsigned int mul_k,signed int real_x,)
{
	  signed long lsl_tmp;
	  signed int lsi_real_y;
	 
	  lsl_tmp=real_x-offset_x;
	  lsl_tmp*=gain_k;
	  lsl_tmp>>=mul_k;
	  lsl_tmp+=offset_y;
	       
	  lsi_real_y=(signed int)lsl_tmp;
	 
	  return lsi_real_y;
}
*/
//------------------------------------------------------------------------------
// *****************************************************************************
// *                                                                           *
// *  函数名称:  int32_t lowpass_filter(int16_t last_val, int16_t last_mod,    *
//                                      int16_t now_val, int16_t index  )      *
// *  功能描述:  低通滤波函数                                                  *
// *  扇入函数:  //被本函数调用的函数清单                                      *
// *  扇出函数:  //调用本函数的函数清单                                        *
// *                                                                           *
// *                                                                           *
// *  输入参数:      last_val      //代表上次的结果                                *
// *             last_mod      //代表上次的余数                                *
// *             now_val       //代表当前的值                                  *
// *             index         //代表根木滤波的级数，以2的次幂为单位           *
// *  输出参数:                                                                *
// *  全局变量：                                                               *
// *  函数返回值: result            //高字代表计算结果,低字代表计算的余数           *
// *  其他说明:   无                                                           *
// *                                                                           *
// *****************************************************************************
//------------------------------------------------------------------------------
int32_t lowpass_filter(int16_t last_val, int16_t last_mod, int16_t now_val, int16_t index)
{
    lword_type tmp;
    lword_type result;
    
    tmp.word.low = 1;  //赋初值
        
    for(tmp.word.high = 0; tmp.word.high < index; tmp.word.high++)
    {
       tmp.word.low*=2;   
    }
    tmp.word.low -= 1;   //[(2^n)-1]
    //----------------------
    result.lword = last_mod;
    result.lword *= tmp.word.low;
    tmp.word.high =(result.lword >> index);  //计算上次根木滤波的余数的(2^n-1)/2^n
    //------------------
    result.lword = last_val;                  
    result.lword *= tmp.word.low;        //上次的结果值乘以[(2^n)-1]
    result.lword += tmp.word.high;       //再加上上次根木滤波的余数的(2^n-1)/2^n
    result.lword += now_val;             //加上当前值
    //------------------
    tmp.word.high = (result.lword >> index);   //得到本次根木滤波的结果
    
    result.ulword <<= (32 - index);
    result.ulword >>= (32 - index);    //得到本次根木滤波的余数      
    
    result.word.high = tmp.word.high;     //将本次结果存到result的高字中
    //------------------    
    return result.lword;
}  
//------------------------------------------------------------------------------





//-------------------------------------------------------------------------------
#endif 						//end 
